{
  "none": "",
  "pages": {
    "homepage": "Page d'accueil",
    "your-page": "Votre page",
    "support": "Support",
    "privacy-policy": "Politique de confidentialité"
  },
  "navbar": {
    "welcome": "Bienvenue sur Tournament Pool!",
    "welcome-login": "Bienvenue sur la page de Connexion!",
    "welcome-user": "Bon retour",
    "login": "Se connecter",
    "login-github": "Login avec GitHub",
    "login-description": "Sur cette application, nous utiliserons votre compte GitHub pour vous connecter en toute sécurité, afin que vous n'ayez pas besoin de créer un nouveau mot de passe.",
    "log-out": "Déconnexion"
  },
  "pagination": {
    "previous": "Précédent",
    "next": "Suivant"
  },
  "footer": {
    "rights": "Tous droits réservés",
    "other-projects": "Allez voir mes autres projets"
  },
  "me": {
    "pronouns": "elle",
    "description": "Développeuse Mobile et Frontend créant des expériences utilisateur élégantes et amusantes.\nPassionnée de UI/UX en provenance de France !",
    "joined": "Rejoint le 28 septembre 2020"
  },
  "language": {
    "french": "Français",
    "english": "Anglais",
    "italian" : "Italien"
  },
  "tournament": {
    "your-tournaments": "Vos tournois ?",
    "tournaments-description": "Vous pouvez créer des tournois ici et retrouver vos précédents.",
    "search-pool": "Recherchez un tournoi...",
    "add": "Ajoutez un tournoi",
    "add-description": "Vous pouvez créer vos propres tournois ici.",
    "created-by": "Créé par : ",
    "edit-information": "Modifier les informations du tournoi",
    "edit": "Modifiez votre tournoi",
    "edit-description": "Vous pouvez modifier votre tournoi ici.",
    "title": "Les graphiques de ce tournoi",
    "description": "Ici, vous pouvez voir les différents graphiques pour ce tournoi."
  },
  "points": {
    "teams": "Points des équipes ?",
    "teams-description": "Ici, vous pouvez voir les points de chaque équipe.",
    "title": "Ajouter plus de points ?",
    "description": "Vous pouvez ajouter des points en fonction de l'équipe.",
    "search": "Rechercher des points...",
    "add": "Ajouter des points",
    "add-description": "Vous pouvez ajouter des points pour vos teams ici."
  },
  "forms": {
    "tournament": {
      "name": "Nom du tournoi",
      "name-description": "Le nom de votre tournoi",
      "team-number": "Combien de teams avez-vous besoin ?",
      "team-number-description": "Le nombre de vos team",
      "name-color": "Nom et Couleur",
      "team-name": "Nom de la Team",
      "create": "Créer un tournoi",
      "update": "Mettre à jour",
      "delete": "Supprimer",
      "delete-title": "Supprimer ",
      "delete-description": "Êtes-vous sûr de vouloir supprimer ce tournoi ?",
      "confirm-delete": "Confirmer la suppression",
      "cancel": "Annuler"
    },
    "points": {
      "which-team": "Pour quelle team ?",
      "choose-team": "Choisissez une team",
      "what-reason": "Quelle raison ?",
      "write-reason": "Écrivez la raison pour ajouter des points",
      "how-many": "Combien de points ?",
      "how-many-description": "Combien de points voulez-vous ajouter ?",
      "add": "Ajouter des points"
    }
  },
  "no": {
    "yet": "Pas encore de tournois !",
    "yours": "Vous n'avez pas encore de tournois !",
    "no-points": "Ce tournoi n'a pas encore de points !"
  },
  "theme": {
    "span": "Changer de thème",
    "light": "Clair",
    "dark": "Sombre",
    "system": "Système"
  },
  "privacy-policy": {
    "last-updated": "Dernière mise à jour : ",
    "small-description-1": "Le site web Tournament-pool (",
    "small-description-2": ") est exploité et maintenu par Lisa Glaziou.",
    "small-description-3": "Cette page vous informe de nos politiques concernant la collecte,\nl'utilisation et la divulgation des informations personnelles que nous recevons des utilisateurs\ndu site web.",
    "1": "1. Collecte et utilisation des informations",
    "1-1": "Nous collectons des informations en utilisant l'authentification OAuth 2.0 avec GitHub.\nLorsque vous vous connectez ou vous inscrivez via GitHub, nous accédons à certaines\ninformations associées à votre compte GitHub, telles que :",
    "1-2": "• Informations personnelles : Votre nom d'utilisateur GitHub, adresse email\net photo de profil (si fournie).",
    "1-3": "• Informations publiques : Tous les dépôts publics ou\nprojets liés à votre compte GitHub.",
    "1-4": "Ces informations sont utilisées pour créer et gérer votre compte et\npersonnaliser votre expérience sur notre plateforme. De plus, nous utilisons\nVercel Analytics pour collecter des données sur les performances et les interactions des utilisateurs.\nCela inclut, mais sans s'y limiter, les vues de pages, la durée des sessions\net les interactions des utilisateurs afin d'améliorer les performances\nde notre plateforme et l'expérience utilisateur.",
    "2": "2. Cookies",
    "2-1": "Les cookies sont des fichiers contenant une petite quantité de données, pouvant\ninclure un identifiant unique anonyme. Les cookies sont envoyés à votre\nnavigateur par un site web et stockés sur le disque dur de votre ordinateur.\nVous pouvez configurer votre navigateur pour refuser tous les cookies ou pour\nindiquer quand un cookie est envoyé. Ce site n'utilise que des cookies\nnécessaires à son bon fonctionnement. Ces cookies ne sont pas utilisés\nà des fins de suivi. Vous devez accepter ces cookies pour\nutiliser notre site.",
    "3": "3. Sécurité",
    "3-1": "La sécurité de vos informations personnelles est importante pour nous.\nDu temps de développement a été consacré à garantir une sécurité maximale\npour tous nos utilisateurs grâce à l'utilisation de services sécurisés. Veuillez noter\nqu'aucune méthode de transmission sur Internet ou méthode\nde stockage électronique n'est sécurisée à 100 %. Bien que nous nous efforcions d'utiliser\nles moyens commercialement acceptables pour protéger vos informations\npersonnelles, nous ne pouvons garantir leur sécurité absolue.",
    "4": "4. Modifications de cette politique de confidentialité",
    "4-1": "Cette politique de confidentialité est en vigueur à partir de la date indiquée ci-dessus et\nrestera en vigueur. Toute modification de ses dispositions sera\nimmédiatement appliquée après sa publication sur cette page. Nous nous réservons\nle droit de mettre à jour ou de modifier notre politique de confidentialité à tout moment, et\nvous devriez consulter cette politique périodiquement. Votre utilisation continue\ndu service après que nous ayons publié des modifications à la politique de confidentialité sur\ncette page constituera votre acceptation de ces modifications et\nvotre consentement à respecter et à être lié par la politique de confidentialité mise à jour.",
    "5": "5. Nous contacter",
    "5-1": "Si vous avez des questions concernant cette politique de confidentialité, veuillez\ncontacter le développeur principal par email à "
  },
  "support": {
    "title": "Questions fréquentes",
    "description-1": "Voici les questions les plus fréquemment posées à propos de Tournament-Pool. ",
    "description-2": "Vous n'arrivez pas à trouver ce que vous cherchez ? ",
    "description-3": "Discutez avec notre équipe !",
    "Q1": {
      "title": "Qu'est ce que Tournament-Pool ?",
      "response": "Tournament-Pool est une plateforme de gestion de tournois conçue pour simplifier la création et la gestion des tournois. Elle permet aux utilisateurs de créer des tournois, de lier des équipes et d'ajouter des points aux équipes respectives. De plus, la plateforme génère automatiquement des graphiques basés sur les données, offrant une représentation dynamique et visuelle des classements des équipes et de leurs performances tout au long du tournoi."
    },
    "Q2": {
      "title": "Quelles sont les principales fonctionnalités de la plateforme ?",
      "response-1": "• Création de tournoi : Créez facilement des tournois avec des équipes liées.",
      "response-2": "• Gestion des points : Assignez et mettez à jour les points des équipes.",
      "response-3": "• Génération de graphiques : Affichez automatiquement les classements des équipes et leurs performances à l'aide de graphiques dynamiques."
    },
    "Q3": {
      "title": "Comment me connecter à Tournament-Pool ?",
      "response-1": "La connexion est simple et sécurisée grâce à l'authentification à deux facteurs de GitHub :",
      "response-2": "1. Cliquez sur le bouton 'Se connecter avec GitHub' sur la page de connexion.",
      "response-3": "2. Saisissez vos identifiants GitHub si nécessaire.",
      "response-4": "3. Complétez le processus d'authentification à deux facteurs en entrant le code envoyé à votre application d'authentification ou à votre e-mail.",
      "response-5": "4. Une fois authentifié, vous serez redirigé vers le tableau de bord de la plateforme."
    },
    "Q4": {
      "title": "Comment créer un tournoi ?",
      "response-1": "La création d'un tournoi est rapide et intuitive :",
      "response-2": "1. Allez dans la section 'Créer un tournoi' dans votre tableau de bord.",
      "response-3": "2. Remplissez les détails du tournoi :",
      "response-4": "   - Titre : Entrez le nom du tournoi.",
      "response-5": "   - Nombre d'équipes : Sélectionnez entre 2 et 5 équipes.",
      "response-6": "   - Noms et couleurs des équipes : Attribuez un nom et une couleur uniques à chaque équipe pour une identification facile.",
      "response-7": "3. Vérifiez vos entrées et cliquez sur 'Créer'.",
      "response-8": "4. Votre tournoi est maintenant créé, et vous pouvez commencer à gérer les points ou afficher les classements."
    },
    "Q5": {
      "title": "À quoi sert la page /show/ID ?",
      "response": "La page /show/ID est une vue publique en lecture seule du tournoi. Elle affiche automatiquement les classements et les points des équipes en fonction des dernières données. Les utilisateurs peuvent voir les résultats et les graphiques de performance sans interaction ou mise à jour manuelle."
    },
    "Q6": {
      "title": "À quoi sert la page /user/tournament/ID ?",
      "response": "La page /user/tournament/ID est destinée à la gestion du tournoi. Les utilisateurs autorisés peuvent mettre à jour les détails, ajouter des points et apporter des modifications aux données du tournoi. Ces mises à jour sont immédiatement reflétées sur la page /show/ID."
    }
  },
  "toast": {
    "login-success": {
      "title": "Bon retour parmi nous !",
      "description": "Vous vous êtes connecté avec succès."
    },
    "login-fail": {
      "title": "Échec de la connexion :",
      "description": "Une erreur s'est produite lors de la connexion. Veuillez réessayer."
    },
    "add-points-success": {
      "title": "Points ajoutés avec succès !",
      "description": "Vous avez ajouté des points au tournoi avec succès."
    },
    "add-points-fail": {
      "title": "Impossible d'ajouter des points au tournoi",
      "description": "Une erreur s'est produite lors de la mise à jour des points du tournoi."
    },
    "delete-points-success": {
      "title": "Points supprimés avec succès !",
      "description": "Vous avez supprimé les points du tournoi avec succès."
    },
    "delete-points-fail": {
      "title": "Impossible de supprimer les points du tournoi",
      "description": "Une erreur s'est produite lors de la suppression des points du tournoi."
    },
    "create-tournament-success": {
      "title": "Création réussie !",
      "description": "Vous avez créé un tournoi avec succès."
    },
    "create-tournament-fail": {
      "title": "Impossible de créer un tournoi.",
      "description": "Une erreur s'est produite lors de la création du tournoi."
    },
    "delete-tournament-success": {
      "title": "Supprimé avec succès !",
      "description": "Vous avez supprimé le tournoi avec succès."
    },
    "delete-tournament-fail": {
      "title": "Impossible de supprimer le tournoi",
      "description": "Une erreur s'est produite lors de la suppression du tournoi."
    },
    "edit-tournament-success": {
      "title": "Mis à jour avec succès !",
      "description": "Vous avez mis à jour le tournoi avec succès."
    },
    "edit-tournament-fail": {
      "title": "Impossible de mettre à jour le tournoi",
      "description": "Une erreur s'est produite lors de la mise à jour du tournoi."
    }
  }
}
